In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [2]:
%%sql
show databases

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('practice',),
 ('sakila',),
 ('sql_practice',),
 ('sys',),
 ('test',),
 ('uber',),
 ('world',)]

In [3]:
%%sql
use practice

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);

INSERT INTO CustomerData VALUES
(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', 5000.00),
(2, 'Priya', NULL, '98765', 'Bangalore', NULL),
(3, 'Arjun', 'arjun@example.com', NULL, 'Hyderabad', 1500.00),
(4, 'Meena', NULL, NULL, 'Mumbai', 2500.00),
(5, 'Karthik', 'karthik@example.com', '98765', NULL, 3000.00);

 * mysql+mysqlconnector://root:***@localhost
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'customerdata' already exists
[SQL: CREATE TABLE CustomerData (
    id INT PRIMARY KEY,
    customer_name VARCHAR(100),
    email VARCHAR(100),
    phone_number VARCHAR(15),
    address VARCHAR(200),
    amount DECIMAL(10, 2)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql
select * from CustomerData

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Ravi', 'ravi@example.com', '98765', 'Chennai', Decimal('5000.00')),
 (2, 'Priya', None, '98765', 'Bangalore', None),
 (3, 'Arjun', 'arjun@example.com', None, 'Hyderabad', Decimal('1500.00')),
 (4, 'Meena', None, None, 'Mumbai', Decimal('2500.00')),
 (5, 'Karthik', 'karthik@example.com', '98765', None, Decimal('3000.00'))]

In [19]:
%%sql
select 
length(customer_name) as length_of_name,
upper(address) as upper_city,
lower(customer_name) as cust_name_lower,
concat(customer_name,'-',address) as concat_name,
substring(Customer_name,1,5) as substring_name,
trim('    chennai    ') as trim,
lpad(customer_name,10,'*') as lpad,
REPLACE(customer_name,' ','-') as replace_NAME,
format(phone_number,2) as formated_number
from CustomerData

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(4, 'CHENNAI', 'ravi', 'Ravi-Chennai', 'Ravi', 'chennai', '******Ravi', 'Ravi', '98,765.00'),
 (5, 'BANGALORE', 'priya', 'Priya-Bangalore', 'Priya', 'chennai', '*****Priya', 'Priya', '98,765.00'),
 (5, 'HYDERABAD', 'arjun', 'Arjun-Hyderabad', 'Arjun', 'chennai', '*****Arjun', 'Arjun', None),
 (5, 'MUMBAI', 'meena', 'Meena-Mumbai', 'Meena', 'chennai', '*****Meena', 'Meena', None),
 (7, None, 'karthik', None, 'Karth', 'chennai', '***Karthik', 'Karthik', '98,765.00')]